Revit 2024 API
AnalyticalMember.Create Method
 Creates a new instance of an Analytical Member within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static AnalyticalMember Create(
	Document aDoc,
	Curve curve
)
Visual Basic
Public Shared Function Create ( _
	aDoc As Document, _
	curve As Curve _
) As AnalyticalMember
Visual C++
public:
static AnalyticalMember^ Create(
	Document^ aDoc,
	Curve^ curve
)
Parameters
aDoc
Type: Autodesk.Revit.DB.Document
 A Revit document.
curve
Type: Autodesk.Revit.DB.Curve
 Curve of the analytical member.
Return Value
 The newly created Analytical Member instance.
Remarks
 The curve must be bounded. The curve can be:
Line
Arc
Ellipse
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input curve is not bound. -or- The provided curve is not supported.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace